app/views/actors/show.html.erb

SELECT  1 AS one FROM "matches" INNER JOIN "matches_actors" ON "matches"."id" = "matches_actors"."match_id" WHERE "matches_actors"."actor_id" = ? LIMIT 1  [["actor_id", 3]]
SELECT "matches".* FROM "matches" INNER JOIN "matches_actors" ON "matches"."id" = "matches_actors"."match_id" WHERE "matches_actors"."actor_id" = ?  [["actor_id", 3]]
---

<% if !@actor.matches.empty? %>

SELECT  "actors".* FROM "actors" INNER JOIN "matches_actors" ON "actors"."id" = "matches_actors"."actor_id" WHERE "matches_actors"."match_id" = ?  ORDER BY "actors"."id" ASC LIMIT 1 OFFSET 1  [["match_id", 2]]
---
        <tr>
          <% if match.actors.first.id == @actor.id %>

SELECT "movies".* FROM "movies" INNER JOIN "movies_actors" ON "movies"."id" = "movies_actors"."movie_id" WHERE "movies_actors"."actor_id" = ?  [["actor_id", 3]]
---
			<ol>
				<% @actor.movies.each do |movie| %>