app/views/users/show.html.erb

SELECT  1 AS one FROM "actors" INNER JOIN "actors_users" ON "actors"."id" = "actors_users"."actor_id" WHERE "actors_users"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "actors".* FROM "actors" INNER JOIN "actors_users" ON "actors"."id" = "actors_users"."actor_id" WHERE "actors_users"."user_id" = ?  [["user_id", 1]]
---

<% if @user.actors.empty? %>