app/views/matches/index.html.erb

<% if logged_in? %>
  <% if current_user.matches.empty?%>
---
SELECT  1 AS one FROM "matches" INNER JOIN "matches_users" ON "matches"."id" = "matches_users"."match_id" WHERE "matches_users"."user_id" = ? LIMIT 1  [["user_id", 1]]