app/views/matches/show.html.erb

SELECT  "actors".* FROM "actors" INNER JOIN "matches_actors" ON "actors"."id" = "matches_actors"."actor_id" WHERE "matches_actors"."match_id" = ?  ORDER BY "actors"."id" ASC LIMIT 1 OFFSET 1  [["match_id", 1]]
SELECT  1 AS one FROM "movies" INNER JOIN "matches_movies" ON "movies"."id" = "matches_movies"."movie_id" WHERE "matches_movies"."match_id" = ? LIMIT 1  [["match_id", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "matches_movies" ON "movies"."id" = "matches_movies"."movie_id" WHERE "matches_movies"."match_id" = ?  [["match_id", 1]]
---
<p>
  The actors <%= link_to @match.actors.first.name, "/actors/#{@match.actors.first.id}" %> and <%= link_to @match.actors.second.name, "/actors/#{@match.actors.second.id}" %> have appeared in
   <% if @match.movies.empty? %>

SELECT  "users".* FROM "users" INNER JOIN "matches_users" ON "users"."id" = "matches_users"."user_id" WHERE "matches_users"."match_id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["match_id", 2]]
SELECT  1 AS one FROM "users" INNER JOIN "matches_users" ON "users"."id" = "matches_users"."user_id" WHERE "matches_users"."match_id" = ? LIMIT 1  [["match_id", 1]]
---
<br>
<% if !@match.users.empty? %>