app/controllers/actors_controller.rb

SELECT  "actors".* FROM "actors" WHERE (LOWER(name) = 'james mcavoy')  ORDER BY "actors"."id" ASC LIMIT 1
INSERT INTO "actors" ("name", "tmdb_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "James McAvoy"], ["tmdb_id", "5530"], ["created_at", "2017-04-27 13:47:32.781444"], ["updated_at", "2017-04-27 13:47:32.781444"]]
SELECT  "movies".* FROM "movies" WHERE "movies"."tmdb_id" = ? LIMIT 1  [["tmdb_id", "2977"]]
SELECT  1 AS one FROM "actors" INNER JOIN "actors_users" ON "actors"."id" = "actors_users"."actor_id" WHERE "actors_users"."user_id" = ? AND "actors"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]
SELECT  1 AS one FROM "movies" WHERE "movies"."tmdb_id" = '2977' LIMIT 1
---
  def create
    @actor = Actor.where('LOWER(name) = ?', params[:name].downcase).first
    unless @actor
      @actor = Actor.new(name: params[:name])
      if @actor.valid_name? && @actor.in_database?
        @actor.reset_name
        @actor.find_tmdb_id
        if @actor.save
          @actor.add_movies
          current_user.actors.append @actor unless current_user.actors.include? @actor

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_actor
      @actor = Actor.find(params[:id])