app/controllers/matches_controller.rb

SELECT  "actors".* FROM "actors" WHERE (LOWER(name) = 'anna kendrick')  ORDER BY "actors"."id" ASC LIMIT 1
SELECT "movies".* FROM "movies" INNER JOIN "movies_actors" ON "movies"."id" = "movies_actors"."movie_id" WHERE "movies_actors"."actor_id" = ?  [["actor_id", 1]]
INSERT INTO "actors" ("name", "tmdb_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Anna Kendrick"], ["tmdb_id", "84223"], ["created_at", "2017-04-27 13:47:10.050389"], ["updated_at", "2017-04-27 13:47:10.050389"]]
INSERT INTO "matches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-04-27 13:47:12.774085"], ["updated_at", "2017-04-27 13:47:12.774085"]]
INSERT INTO "movies" ("title", "tmdb_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Scott Pilgrim vs. the World"], ["tmdb_id", "22538"], ["created_at", "2017-04-27 13:47:10.348289"], ["updated_at", "2017-04-27 13:47:10.348289"]]
SELECT  1 AS one FROM "movies" INNER JOIN "movies_actors" ON "movies"."id" = "movies_actors"."movie_id" WHERE "movies_actors"."actor_id" = ? AND "movies"."id" = ? LIMIT 1  [["actor_id", 2], ["id", 1]]
SELECT  1 AS one FROM "matches" INNER JOIN "matches_users" ON "matches"."id" = "matches_users"."match_id" WHERE "matches_users"."user_id" = ? AND "matches"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
---
  def create
    first = Actor.where('LOWER(name) = ?', params[:first].downcase).take
    second = Actor.where('LOWER(name) = ?', params[:second].downcase).take
    if first && second
      first.matches.each do |m|
        @match = m if second.matches.include? m
      end
    end
    unless @match
      @match = Match.new
      first = help(params[:first])
      second = help(params[:second])
      if first && second && first.id != second.id
        first.movies.each do |movie|
          @match.movies << movie if second.movies.include? movie
        end
        if @match.save
          @match.actors << first
          @match.actors << second
          if logged_in?
            current_user.matches.append @match unless current_user.matches.include? @match

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_match
      @match = Match.find(params[:id])