app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.password = params[:user][:password]
    if @user.save
---
INSERT INTO "users" ("name", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Rachel"], ["password_hash", "$2a$10$LEC6i2Kp1drRuV4QmmgJpuo13yJLmvkpyr7V0qxevUcPVFSaRx/la"], ["created_at", "2017-04-27 13:47:23.908544"], ["updated_at", "2017-04-27 13:47:23.908544"]]